**Import Package**

In [ ]:
import pandas as pd

**Series**

In [ ]:
# pd.Series
a = pd.Series([1, 2, 3, 4])
a
# .array
a.array

# .index
a.index

In [ ]:
# non-integer index

a = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
a

In [ ]:
# non-unique indices

a = pd.Series([1, 2, 3, 4], index=['a', 'a', 'a', 'd'])
a['a']

In [ ]:
# series as a dictionary

a = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4})
a.to_dict()

In [ ]:
# arithmatic operations

b = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4})

a * b

In [ ]:
# NaN values - isna, notna

c = pd.Series({'a': 1, 'b': 2, 'd': 4, 'e': 5})

d = a + c

d

In [ ]:
d.isna()

In [ ]:
d.notna()

In [ ]:
# dropna

d.dropna()

In [ ]:
# fillna

d.fillna(10)

In [ ]:
# arithmatic with fill_value
print(a)
print(c)
a.add(c, fill_value=5)

In [ ]:
# drop values by index

a.drop(['b', 'c'])

**DataFrame**

In [ ]:
# dataframe
import numpy as np
arr = np.arange(20).reshape((5, 4))
print(arr)
df = pd.DataFrame(arr, columns=['A', 'B', 'C', 'D'], index=[10, 20, 30, 40, 50])
df

In [ ]:
# dictionary of series

df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                   'B': [6, 7, 8, 9, 10]}, index=[10, 20, 30, 40, 50])
df

In [ ]:
# dictionary of dictionaries

df = pd.DataFrame({'A': {10: 1, 20: 2, 30: 3},
                   'B': {10: 1, 25: 3, 40: 5}})
df

In [ ]:
# columns and index

df.columns

df.index

In [ ]:
# accessing columns
# dict
df['B']

# dot
df.A

In [ ]:
# mutable

df['A'][10] = 50
df

In [ ]:
df['A'] = 10
df

In [ ]:
# delete columns
del df['B']

# drop

df.drop(columns=['C'], inplace=True)

In [ ]:
# astype

df['A'] = df['A'].astype(str)
df['A'] = df['A'] + '5'
df

In [ ]:
# string
print(df)
df['A'].str.split('')

**Indexing**

In [ ]:
# loc
print(df)

df.loc[10]

In [ ]:
df.loc[[10, 20]]

In [ ]:
df.loc[10:30]

In [ ]:
# iloc

df.iloc[0]

In [ ]:
df.iloc[[1, 2]]

In [ ]:
df.iloc[0:2]

In [ ]:
# boolean
df[df['D'] > 10]

In [ ]:
# reindexing
df = df.reindex([8, 9, 10, 11, 20])
df

**Applying Functions**

In [ ]:
# numpy ufuncs

np.sqrt(df)

In [ ]:
df.apply(np.sqrt)

In [ ]:
# 1-d array wise application - apply

def arrayfun(arr):
    return np.sum(arr)

df.apply(arrayfun)

In [ ]:
# axis-rows

df.apply(arrayfun, axis='index') # or axis=0

In [ ]:
# axis-columns

df.apply(arrayfun, axis='columns') # or axis=1

In [ ]:
# elementwise application - map

def elementfun(x):
    return x*5

df.map(elementfun)

**Sorting**

In [ ]:
# sort_values

print(df)
print(df['A'].sort_values())

In [ ]:
# sort_index

print(df)
print(df['A'].sort_index())

**Statistics**

In [ ]:
# sum, mean

df.sum()
df.mean()

In [ ]:
# axis

df.sum(axis=0)
df.mean(axis=1)

In [ ]:
# describe

df.describe()

In [ ]:
# unique

df['A'].unique()

In [ ]:
df.loc[10].unique()

In [ ]:
# value_counts

df['B'].value_counts()

**File Reading**

In [ ]:
df = pd.read_csv('grades.csv')
df

**Views**

In [ ]:
# head

df.head()

In [ ]:
# tail

df.tail()

**File Writing**

In [ ]:
# to csv

df.to_csv('grades_new.csv')

In [ ]:
df.to_csv('grades_new.csv', index=False)

In [ ]:
df2 = pd.read_csv('grades_new.csv')
df2.head()

In [ ]:
df2 = pd.read_csv('grades_new.csv', index_col=0)
df2.head()

**Merge on Columns**

In [ ]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    "key": ["a", "a", "b", "b", "b", "c"],
    "data1": np.arange(1, 7)
})
df1

  key  data1
0   a      1
1   a      2
2   b      3
3   b      4
4   b      5
5   c      6

In [ ]:
df2 = pd.DataFrame({
    "key": ["a", "b", "d"],
    "data2": np.arange(1, 4)
})
df2

  key  data2
0   a      1
1   b      2
2   d      3

In [ ]:
# merge - on

pd.merge(df1, df2, on='key')

  key  data1  data2
0   a      1      1
1   a      2      1
2   b      3      2
3   b      4      2
4   b      5      2

In [ ]:
# merge - left_on and right_on

pd.merge(df1, df2, left_on='a', right_on='key')

  key  data1  data2
0   a      1      1
1   a      2      1
2   b      3      2
3   b      4      2
4   b      5      2

In [ ]:
# merge - intersection

pd.merge(df1, df2, on='key', how='inner')

  key  data1  data2
0   a      1      1
1   a      2      1
2   b      3      2
3   b      4      2
4   b      5      2

In [ ]:
# merge - left

pd.merge(df1, df2, on='key', how='left')

  key  data1  data2
0   a      1    1.0
1   a      2    1.0
2   b      3    2.0
3   b      4    2.0
4   b      5    2.0
5   c      6    NaN

In [ ]:
# merge - right

pd.merge(df1, df2, on='key', how='right')

  key  data2  data1
0   a    1.0      1
1   a    1.0      2
2   b    2.0      3
3   b    2.0      4
4   b    2.0      5
5   c    NaN      6

In [ ]:
# merge - union

pd.merge(df1, df2, on='key', how='outer')

  key  data1  data2
0   a    1.0    1.0
1   a    2.0    1.0
2   b    3.0    2.0
3   b    4.0    2.0
4   b    5.0    2.0
5   c    6.0    NaN
6   d    NaN    3.0

**Merge on Index**

In [ ]:
df1 = pd.DataFrame({
    "type": ["a", "a", "b", "b", "b", "c"],
    "rating": np.arange(1, 7),
}, index = [2, 4, 6, 8, 10, 12])
df1

   type  rating
2     a       1
4     a       2
6     b       3
8     b       4
10    b       5
12    c       6

In [ ]:
df2 = pd.DataFrame({
    "range": np.arange(3, 6)
}, index = [4, 5, 6])
df2

   range
4      3
5      4
6      5

In [ ]:
# merge on indices

pd.merge(df1, df2, left_index=True, right_index=True)

  type  rating  range
4    a       2      3
6    b       3      5

In [ ]:
# join

df1.join(df2)

   type  rating  range
2     a       1    NaN
4     a       2    3.0
6     b       3    5.0
8     b       4    NaN
10    b       5    NaN
12    c       6    NaN

**Concat on Series**

In [ ]:
s1 = pd.Series({'a': 1, 'b': 2})
s1

a    1
b    2
dtype: int64

In [ ]:
s2 = pd.Series({'c': 3, 'd': 4, 'a': 5})
s2

c    3
d    4
a    5
dtype: int64

In [ ]:
s3 = pd.Series({'e': 6, 'f': 7})
s3

e    6
f    7
dtype: int64

In [ ]:
# concat by index

pd.concat([s1, s2, s3], axis='index')

a    1
b    2
c    3
d    4
a    5
e    6
f    7
dtype: int64

In [ ]:
# concat by columns

pd.concat([s1, s2, s3], axis='columns')

     0    1    2
a  1.0  5.0  NaN
b  2.0  NaN  NaN
c  NaN  3.0  NaN
d  NaN  4.0  NaN
e  NaN  NaN  6.0
f  NaN  NaN  7.0

In [ ]:
# concat - give column names using keys

pd.concat([s1, s2, s3], axis='columns', keys=['A', 'B', 'C'])

     A    B    C
a  1.0  5.0  NaN
b  2.0  NaN  NaN
c  NaN  3.0  NaN
d  NaN  4.0  NaN
e  NaN  NaN  6.0
f  NaN  NaN  7.0

In [ ]:
# concat - inner join

pd.concat([s1, s2, s3], axis='columns', keys=['A', 'B', 'C'])

     A    B    C
a  1.0  5.0  NaN
b  2.0  NaN  NaN
c  NaN  3.0  NaN
d  NaN  4.0  NaN
e  NaN  NaN  6.0
f  NaN  NaN  7.0

**Concat on DataFrames**

In [ ]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['one', 'two'])
df1

  one  two
0   a    1
1   b    2

In [ ]:
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['three', 'four'])
df2

  three  four
0     c     3
1     d     4

In [ ]:
# concat by rows

pd.concat([df1, df2], axis='index')

   one  two three  four
0    a  1.0   NaN   NaN
1    b  2.0   NaN   NaN
0  NaN  NaN     c   3.0
1  NaN  NaN     d   4.0

In [ ]:
# concat by rows - ignore_index

pd.concat([df1, df2], axis='index', ignore_index=True)

   one  two three  four
0    a  1.0   NaN   NaN
1    b  2.0   NaN   NaN
2  NaN  NaN     c   3.0
3  NaN  NaN     d   4.0

In [ ]:
# concat by columns

pd.concat([df1, df2], axis='columns')

  one  two three  four
0   a    1     c     3
1   b    2     d     4

**Row-Column Rotation**

In [ ]:
df = pd.DataFrame(
    np.arange(1, 7).reshape((2, 3)),
    index = ['Lahore', 'Karachi'],
    columns = ['one', 'two', 'three']
)
df

         one  two  three
Lahore     1    2      3
Karachi    4    5      6

In [ ]:
# stack

res = df.stack()
res

Lahore   one      1
         two      2
         three    3
Karachi  one      4
         two      5
         three    6
dtype: int32

In [ ]:
# hierarchical indexing

res.loc['Lahore']

one      1
two      2
three    3
dtype: int32

In [ ]:
res.loc['Lahore', 'two']

2

In [ ]:
res.loc[:, 'two']

Lahore     2
Karachi    5
dtype: int32

In [ ]:
# unstack

res.unstack()

         one  two  three
Lahore     1    2      3
Karachi    4    5      6

**Grouping**

In [ ]:
df = pd.DataFrame({
    'Province': ['Punjab', 'Punjab', 'Sindh', 'KP', 'Sindh', 'Baluchistan'],
    'City': ['Lahore', 'Faisalabad', 'Karachi', 'Peshawar', 'Hyderabad', 'Quetta'],
    'Population': [150, 120, 200, 100, 100, 25],
})
df

      Province        City  Population
0       Punjab      Lahore         150
1       Punjab  Faisalabad         120
2        Sindh     Karachi         200
3           KP    Peshawar         100
4        Sindh   Hyderabad         100
5  Baluchistan      Quetta          25

In [ ]:
df[df['Province'] == 'Punjab']

  Province        City  Population
0   Punjab      Lahore         150
1   Punjab  Faisalabad         120

In [ ]:
# groupby

groupby = df.groupby(df['Province'])

In [ ]:
# count

groupby.count()

             City  Population
Province
Baluchistan     1           1
KP              1           1
Punjab          2           2
Sindh           2           2

In [ ]:
# iteration

for name, values in groupby:
    print(name)
    print(values)

Baluchistan
      Province    City  Population
5  Baluchistan  Quetta          25
KP
  Province      City  Population
3       KP  Peshawar         100
Punjab
  Province        City  Population
0   Punjab      Lahore         150
1   Punjab  Faisalabad         120
Sindh
  Province       City  Population
2    Sindh    Karachi         200
4    Sindh  Hyderabad         100

In [ ]:
# aggregation functions

groupby['Population'].sum()
groupby['Population'].mean()

Province
Baluchistan     25.0
KP             100.0
Punjab         135.0
Sindh          150.0
Name: Population, dtype: float64

In [ ]:
# custom aggregators - agg

def summation(arr):
    return np.sum(arr) + 50

groupby['Population'].agg(summation)

Province
Baluchistan     75
KP             150
Punjab         320
Sindh          350
Name: Population, dtype: int64

**Exercise - Foods.csv**

In [ ]:
df = pd.read_csv('foods.csv')
df.head()

,FOOD NAME,SCIENTIFIC NAME,GROUP,SUB GROUP
0,Angelica,Angelica keiskei,Herbs and Spices,Herbs
1,Savoy cabbage,Brassica oleracea var. sabauda,Vegetables,Cabbages
2,Silver linden,Tilia argentea,Herbs and Spices,Herbs
3,Kiwi,Actinidia chinensis,Fruits,Tropical fruits
4,Allium (Onion),Allium,Vegetables,Onion-family vegetables

In [ ]:
df.columns

Index(['FOOD NAME', 'SCIENTIFIC NAME', 'GROUP', 'SUB GROUP'], dtype='object')

In [ ]:
df.describe()

       FOOD NAME  SCIENTIFIC NAME          GROUP SUB GROUP
count        907              648            907       907
unique       907              639             24       123
top     Angelica  Capsicum annuum  Aquatic foods    Fishes
freq           1                6            166       111

In [ ]:
df.isna().sum()

FOOD NAME            0
SCIENTIFIC NAME    259
GROUP                0
SUB GROUP            0
dtype: int64

In [ ]:
df.loc[df['SCIENTIFIC NAME'].isna(), 'SCIENTIFIC NAME'] = "Unknown"

In [ ]:
df.tail()

,FOOD NAME,SCIENTIFIC NAME,GROUP,SUB GROUP
902,Romaine lettuce,Lactuca sativa L. var. longifolia,Vegetables,Leaf vegetables
903,"Cow milk, pasteurized, vitamin A + D added, 0%...",Unknown,Milk and milk products,Unfermented milks
904,"Cow milk, pasteurized, vitamin A + D added, 1%...",Unknown,Milk and milk products,Unfermented milks
905,"Cow milk, pasteurized, vitamin A + D added, 2%...",Unknown,Milk and milk products,Unfermented milks
906,"Cow milk, pasteurized, vitamin D added, 3.25% fat",Unknown,Milk and milk products,Unfermented milks

In [ ]:
df.describe()

       FOOD NAME SCIENTIFIC NAME          GROUP SUB GROUP
count        907             907            907       907
unique       907             640             24       123
top     Angelica         Unknown  Aquatic foods    Fishes
freq           1             259            166       111

In [ ]:
df.groupby(df['GROUP']).count()

                             FOOD NAME  SCIENTIFIC NAME  SUB GROUP
GROUP
Animal foods                        44               44         44
Aquatic foods                      166              166        166
Baby foods                           1                1          1
Baking goods                        33               33         33
Beverages                           30               30         30
Cereals and cereal products         48               48         48
Cocoa and cocoa products             8                8          8
Coffee and coffee products           5                5          5
Confectioneries                     29               29         29
Dishes                              51               51         51
Eggs                                 1                1          1
Fats and oils                        8                8          8
Fruits                             130              130        130
Gourds                              17               17         17
Herbs and Spices                   108              108        108
Herbs and spices                     1                1          1
Milk and milk products              23               23         23
Nuts                                27               27         27
Pulses                              26               26         26
Snack foods                          8                8          8
Soy                                  9                9          9
Teas                                 3                3          3
Unclassified                         1                1          1
Vegetables                         130              130        130

In [ ]:
df["FOOD NAME"] = df["FOOD NAME"].str.split(',').str[0]

In [ ]:
df.tail()

,FOOD NAME,SCIENTIFIC NAME,GROUP,SUB GROUP
902,Romaine lettuce,Lactuca sativa L. var. longifolia,Vegetables,Leaf vegetables
903,Cow milk,Unknown,Milk and milk products,Unfermented milks
904,Cow milk,Unknown,Milk and milk products,Unfermented milks
905,Cow milk,Unknown,Milk and milk products,Unfermented milks
906,Cow milk,Unknown,Milk and milk products,Unfermented milks